app/views/o_propostas/_form.html.erb

SELECT "o_orcamentos".* FROM "o_orcamentos"
---
        <div class="col-md-6">
          <%= f.association :o_orcamento,
                collection: OOrcamento.all.map { |o| [ "#{o.g_veiculo.modelo} - #{o.valor_total}", o.id ] },
                label: "Orçamento",
                prompt: "Selecione o orçamento",
                input_html: { class: "form-select" } %>

SELECT "users".* FROM "users" INNER JOIN "g_tipo_usuarios" ON "g_tipo_usuarios"."id" = "users"."g_tipo_usuario_id" WHERE "g_tipo_usuarios"."descricao" = $1  [["descricao", "FORNECEDOR"]]
---
        <div class="col-md-6">
          <%= f.association :user,
                collection: User.joins(:g_tipo_usuario).where(g_tipo_usuarios: { descricao: "FORNECEDOR" }).map { |u| ["#{u.nome} (#{u.cpf})", u.id] },
                label: "Fornecedor",
                prompt: "Selecione o fornecedor",
                input_html: { class: "form-select" } %>

SELECT "o_status".* FROM "o_status"
---
        <div class="col-md-6">
          <%= f.association :o_status,
                collection: OStatus.all.map { |s| [s.descricao, s.id] },
                label: "Status",
                prompt: "Selecione o status",
                input_html: { class: "form-select" } %>