app/views/devise/registrations/new.html.erb

SELECT "g_tipo_usuarios".* FROM "g_tipo_usuarios"
---
            <div class="col-md-6">
              <%= f.input :g_tipo_usuario_id, collection: GTipoUsuario.all, label_method: :descricao, value_method: :id, prompt: "Selecione o tipo de usuário", required: true, input_html: { class: "form-select" } %>

SELECT "g_status".* FROM "g_status"
---
            <div class="col-md-6">
              <%= f.input :g_status_id, collection: GStatus.all, label_method: :descricao, value_method: :id, prompt: "Selecione o status", required: true, input_html: { class: "form-select" } %>