app/views/g_veiculos/_form.html.erb

        <div class="col-3">
          <%= f.input :g_centro_custo_id, collection: GCentroCusto.all, label_method: :nome, value_method: :id, prompt: "Selecione o Tipo de Centro de Custo" %>
---
SELECT "g_centro_custos".* FROM "g_centro_custos"

        <div class="col-3">
          <%= f.input :g_cartao_veiculo_id,
                collection: GCartaoVeiculo.all,
                label_method: :numero_cartao,
                value_method: :id,
                prompt: "Selecione o Cartão vinculado" %>
---
SELECT "g_cartao_veiculos".* FROM "g_cartao_veiculos"