app/views/o_orcamentos/_form.html.erb

        <div class="col-md-3">
          <%= f.input :user_id,
                      collection: User.all,
                      label_method: :nome,
                      value_method: :id,
                      prompt: "Selecione o usuário",
                      label: "Gestor" %>
---
SELECT "users".* FROM "users"

        <div class="col-md-3">
          <%= f.input :g_veiculo_id,
                      collection: GVeiculo.all,
                      label_method: :marca,
                      value_method: :id,
                      prompt: "Selecione o veículo",
                      label: "Veículo" %>
---
SELECT "g_veiculos".* FROM "g_veiculos"

        <div class="col-md-3">
          <%= f.input :g_centro_custo_id,
                      collection: GCentroCusto.all,
                      label_method: :nome,
                      value_method: :id,
                      prompt: "Selecione o centro de custo",
                      label: "Centro de Custo" %>
---
SELECT "g_centro_custos".* FROM "g_centro_custos"

        <div class="col-md-3">
          <%= f.input :o_status_id,
                      collection: OStatus.all,
                      label_method: :descricao,
                      value_method: :id,
                      prompt: "Selecione o status",
                      label: "Status" %>
---
SELECT "o_status".* FROM "o_status"