app/views/g_condutores/_form.html.erb

        <div class="col-3">
          <%= f.input :g_status_id, collection: GStatus.all, label_method: :descricao, value_method: :id, prompt: "Selecione o Status do Condutor" %>
---
SELECT "g_status".* FROM "g_status"