app/views/o_orcamento_propostas/_form.html.erb

SELECT "o_propostas".* FROM "o_propostas"
---
      <h5 class="my-0">
        <%= @o_orcamento_proposta.new_record? ? "Incluir " : "Editar " %><%= t("activerecord.models.#{OOrcamentoProposta.model_name.i18n_key}.one") %>

SELECT "o_status_aprovacao".* FROM "o_status_aprovacao"
---
        <div class="col-12">
          <%= f.input :o_status_aprovacao_id, collection: OStatusAprovacao.all, label_method: :descricao, value_method: :id, prompt: "Status da Solicitação de Proposta" %>