app/controllers/g_cartao_veiculos_controller.rb

INSERT INTO "g_cartao_veiculos" ("numero_cartao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["numero_cartao", 1234], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-20 19:09:00.443534"], ["updated_at", "2025-09-20 19:09:00.443534"]]
---
  def create
    @g_cartao_veiculo = GCartaoVeiculo.new(g_cartao_veiculo_params)

    if @g_cartao_veiculo.save