app/controllers/g_centro_custos_controller.rb

INSERT INTO "g_centro_custos" ("nome", "g_tipo_centro_custo_id", "valor_inicial", "saldo_atual", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @g_centro_custo = GCentroCusto.new(g_centro_custo_params)

    if @g_centro_custo.save

UPDATE "g_centro_custos" SET "nome" = $1, "updated_at" = $2 WHERE "g_centro_custos"."id" = $3  [["nome", "Renda"], ["updated_at", "2025-09-18 06:01:58.827788"], ["id", 1]]
---
  def update
    if @g_centro_custo.update(g_centro_custo_params)

SELECT "g_centro_custos".* FROM "g_centro_custos" WHERE "g_centro_custos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_g_centro_custo
    @g_centro_custo = GCentroCusto.find_by(id: params[:id])