app/controllers/g_status_controller.rb

INSERT INTO "g_status" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Ativo"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-18 05:09:00.532990"], ["updated_at", "2025-09-18 05:09:00.532990"]]
---
  def create
    @g_status = GStatus.new(g_status_params)

    if @g_status.save

DELETE FROM "g_status" WHERE "g_status"."id" = $1  [["id", 2]]
---
def destroy
  if @g_status.destroy

SELECT "g_status".* FROM "g_status" WHERE "g_status"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
 def set_g_status
  @g_status = GStatus.find_by(id: params[:id])