app/controllers/g_tipos_centro_custo_controller.rb

  def create
    @g_tipo_centro_custo = GTipoCentroCusto.new(g_tipo_centro_custo_params)

    if @g_tipo_centro_custo.save
      redirect_to g_tipos_centro_custo_path, notice: t('messages.created_successfully')
---
INSERT INTO "g_tipos_centro_custo" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Gabinete do Prefeito"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-18 05:30:01.929641"], ["updated_at", "2025-09-18 05:30:01.929641"]]