app/controllers/home_controller.rb

SELECT SUM("o_orcamentos"."valor_total") FROM "o_orcamentos"
SELECT COUNT(DISTINCT "g_veiculos"."id") FROM "g_veiculos" INNER JOIN "o_orcamentos" ON "o_orcamentos"."g_veiculo_id" = "g_veiculos"."id"
SELECT COUNT(*) FROM "g_veiculos"
SELECT COUNT(*) AS "count_all", "o_statuses"."descricao" AS "o_statuses_descricao" FROM "o_orcamentos" INNER JOIN "o_status" ON "o_status"."id" = "o_orcamentos"."o_status_id" GROUP BY "o_statuses"."descricao"
SELECT COUNT(*) FROM "users" WHERE (created_at >= $1)  [[nil, "2025-09-01"]]
---
  def index
    # Financeiro
    @total_orcamentos = OOrcamento.sum(:valor_total)

    # Veículos
    @veiculos_orcamentados = GVeiculo.joins(:o_orcamentos).distinct.count
    @total_veiculos = GVeiculo.count

    # Solicitações por status
    # Ajuste para o nome real da tabela
    @solicitacoes_status = OOrcamento.joins(:o_status)
                                     .group('o_status.descricao')
                                     .count

    # Para exemplo de cards de clientes/admin
    @novos_usuarios_mes = User.where('created_at >= ?', Date.today.beginning_of_month).count