app/controllers/o_categorias_servico_controller.rb

INSERT INTO "o_categorias_servico" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Troca de Pneu"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-18 05:40:47.430292"], ["updated_at", "2025-09-18 05:40:47.430292"]]
---
  def create
    @o_categoria_servico = OCategoriaServico.new(o_categoria_servico_params)

    if @o_categoria_servico.save
      redirect_to o_categorias_servico_path, notice: t('messages.created_successfully')