app/controllers/o_orcamento_propostas_controller.rb

INSERT INTO "o_orcamento_propostas" ("o_orcamento_id", "o_proposta_id", "o_status_aprovacao_id", "aprovado_por", "aprovado_em", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @o_orcamento_proposta = OOrcamentoProposta.new(o_orcamento_proposta_params)

    if @o_orcamento_proposta.save

SELECT "o_propostas".* FROM "o_propostas" WHERE "o_propostas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_o_orcamento_proposta
    @o_orcamento_proposta = OOrcamentoProposta.find_by(id: params[:id])