app/controllers/o_orcamentos_controller.rb

  def create
    @o_orcamento = OOrcamento.new(o_orcamento_params)

    if @o_orcamento.save
---
INSERT INTO "o_orcamentos" ("user_id", "g_veiculo_id", "g_centro_custo_id", "o_tipo_solicitacao_id", "o_status_id", "valor_total", "itens", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    if @o_orcamento.update(o_orcamento_params)
---
UPDATE "o_orcamentos" SET "g_veiculo_id" = $1, "updated_at" = $2 WHERE "o_orcamentos"."id" = $3  [["g_veiculo_id", 2], ["updated_at", "2025-09-18 08:23:50.641869"], ["id", 1]]

  def set_o_orcamento
    @o_orcamento = OOrcamento.find_by(id: params[:id])
---
SELECT "o_orcamentos".* FROM "o_orcamentos" WHERE "o_orcamentos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]