app/controllers/o_propostas_controller.rb

INSERT INTO "o_propostas" ("o_orcamento_id", "user_id", "o_status_id", "valor_total", "itens", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @o_proposta = OProposta.new(o_proposta_params)

    if @o_proposta.save