app/controllers/o_status_aprovacao_controller.rb

  def create
    @o_status_aprovacao = OStatusAprovacao.new(o_status_aprovacao_params)

    if @o_status_aprovacao.save
---
INSERT INTO "o_status_aprovacao" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Aprovado"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-20 19:51:40.506226"], ["updated_at", "2025-09-20 19:51:40.506226"]]