app/controllers/o_status_controller.rb

INSERT INTO "o_status" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Publicado"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-18 05:33:36.219561"], ["updated_at", "2025-09-18 05:33:36.219561"]]
---
  def create
    @o_status = OStatus.new(o_status_params)

    if @o_status.save

DELETE FROM "o_status" WHERE "o_status"."id" = $1  [["id", 1]]
---
  def destroy
    if @o_status.destroy

SELECT "o_status".* FROM "o_status" WHERE "o_status"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_o_status
    @o_status = OStatus.find_by(id: params[:id])