app/controllers/o_tipos_solicitacao_controller.rb

INSERT INTO "o_tipos_solicitacao" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Serviço"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-18 05:37:14.583475"], ["updated_at", "2025-09-18 05:37:14.583475"]]
---
  def create
    @o_tipo_solicitacao = OTipoSolicitacao.new(o_tipo_solicitacao_params)

    if @o_tipo_solicitacao.save
      redirect_to o_tipos_solicitacao_path, notice: t('messages.created_successfully')

DELETE FROM "o_tipos_solicitacao" WHERE "o_tipos_solicitacao"."id" = $1  [["id", 4]]
---
  def destroy
    if @o_tipo_solicitacao.destroy
      redirect_to o_tipos_solicitacao_url, notice: t('messages.deleted_successfully')